In [6]:
  ## Data Manipulation with Pandas
import pandas

In [7]:
import pandas as pd

In [8]:
## Introducing Pandas Objects
import numpy as np
import pandas as pd

In [9]:
## The Pandas Series Object
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [10]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [11]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
data[1]

0.5

In [13]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [14]:
# Series as generalized NumPy array
data = pd.Series([0.25, 0.5, 0.75,1.0],
                index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [15]:
data['b']

0.5

In [19]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                index=[2,5,3,7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [20]:
data[5]

0.5

In [21]:
# Series as specialized dictionary
population_dict = {'California': 38332521,
                  'Texas': 26448193,
                  'New York': 19651127,
                  'Florida': 19552860,
                  'Illinois':12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [22]:
population['California']

38332521

In [23]:
population['California':'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [24]:
# Constructing Series objects
pd.Series([2,4,6])

0    2
1    4
2    6
dtype: int64

In [25]:
pd.Series(5, index=[100, 200, 300])

100    5
200    5
300    5
dtype: int64

In [26]:
pd.Series({2:'a', 1:'b', 3:'c'})

2    a
1    b
3    c
dtype: object

In [27]:
pd.Series({2:'a', 1:'b', 3:'c'}, index= [3,2])

3    c
2    a
dtype: object

In [29]:
## The Pandas DataFrame Object
# Dataframe as a generalized NumPy array
area_dict = {'California': 423967, 'Texas':695662, 'New York': 141297, 'Florida': 170312, 'Illinois': 149995}

In [30]:
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [33]:
import pandas as pd

In [35]:
states = pd.DataFrame({'population': population, 'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [36]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [37]:
states.columns

Index(['population', 'area'], dtype='object')

In [38]:
# DataFrame as specialized dictionary
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [39]:
# Constructing DataFrame objects
# From a single Seires object
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [40]:
# From a list of dicts
data= [{'a':i, 'b':2*i}
      for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [41]:
pd.DataFrame([{'a':1, 'b':2}, {'b':3, 'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [42]:
# From a two- dimensional NumPy array
pd.DataFrame(np.random.rand(3,2),
            columns=['foo','bar'],
            index=['a','b','c'])

        foo       bar
a  0.761955  0.919059
b  0.352709  0.767481
c  0.318923  0.815884

In [43]:
# From a Numpy structured array
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [44]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

In [45]:
## The Pandas Index Object
ind = pd.Index([2,3,5,7,11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [46]:
# Index as immutable array
ind[1]

3

In [47]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [48]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [50]:
ind[1] = 0

TypeError: Index does not support mutable operations

In [51]:
# Index as ordered set
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])

In [53]:
indA & indB #intersection

Int64Index([3, 5, 7], dtype='int64')

In [55]:
indA | indB # union

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [56]:
indA ^ indB # symmetric difference

Int64Index([1, 2, 9, 11], dtype='int64')

In [64]:
## Data Indexing and Selection
#@ Data Selection in Series
# Series as dictionary
import pandas as pd
data = pd.Series([0.25, 0.5, 0.75,1.0], index=['a', 'b', 'c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [65]:
data['b']

0.5

In [59]:
'a' in data

True

In [60]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [61]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [73]:
data['e'] =1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [66]:
# Series as one-dimensional array
# slicing by explicit index
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [69]:
# slicing by implicit integer index
data[0:2]

a    0.25
b    0.50
dtype: float64

In [70]:
# masking
data[(data>0.3) & (data <0.8)]

b    0.50
c    0.75
dtype: float64

In [74]:
# fancy indexing
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

In [77]:
# Indexers: loc, iloc, and ix
data= pd.Series(['a','b','c'], index=[1,3,5])
data

1    a
3    b
5    c
dtype: object

In [78]:
# explicit index when indexing
data[1]

'a'

In [79]:
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

In [80]:
data.iloc[1]

'b'

In [81]:
data.iloc[1:3]

3    b
5    c
dtype: object

In [82]:
## Data Selection in DataFrame
# DataFrame as a dictionary
area = pd.Series({'California': 423967, 'Texas':695662, 'New York': 141297, 'Florida': 170312, 'Illinois': 149995})
pop = pd.Series({'California': 38332521,
                  'Texas': 26448193,
                  'New York': 19651127,
                  'Florida': 19552860,
                  'Illinois':12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [83]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [84]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [85]:
data.area is data['area']

True

In [86]:
data.pop is data['pop']

False

In [88]:
data['density'] =data['pop']/data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [89]:
# Dataframe as two-dimensional array
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [90]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [91]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [92]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [93]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [95]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [96]:
data.ix[:3, :'pop']

C:\Users\seung\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [97]:
data.loc[data.density>100, ['pop','density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [99]:
data.iloc[0,2] =90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [100]:
# Additional indexing conventions
data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [101]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [102]:
data[data.density>100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

In [103]:
## Operating on Data in Pandas
# Ufuns: Index Preservation
import pandas as pd
import numpy as np

In [104]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [110]:
df = pd.DataFrame(rng.randint(0,10, (3,4)),
                 columns= ['A', 'B','C','D'])
df

   A  B  C  D
0  5  8  0  9
1  2  6  3  8
2  2  4  2  6

In [111]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [112]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -0.707107 -2.449294e-16  0.000000  7.071068e-01
1  1.000000 -1.000000e+00  0.707107 -2.449294e-16
2  1.000000  1.224647e-16  1.000000 -1.000000e+00

In [113]:
## UFuncs: Index Alignment
# Index alignment in Series
area = pd.Series({'Alaska': 1723337, 'Texas': 695662, 'California': 423967}, name='area')
population= pd.Series({'California': 38332521, 'Texas': 26448193, 'New York': 19651127}, name= 'population')

In [114]:
population/ area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [115]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [116]:
A = pd.Series([2, 4, 6], index=[0,1,2])
B = pd.Series([1,3,5], index = [1,2,3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [117]:
A.add(B, fill_value = 0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [121]:
# Index alignment in DataFrame
A = pd.DataFrame(rng.randint(0,20, (2,2)),
                columns = list('AB'))
A

    A   B
0  13  17
1   8   1

In [124]:
B = pd.DataFrame(rng.randint(0,10,(3,3)), 
                columns =list('BAC'))
B

   B  A  C
0  1  5  5
1  9  3  5
2  1  9  1

In [125]:
A+B

      A     B   C
0  18.0  18.0 NaN
1  11.0  10.0 NaN
2   NaN   NaN NaN

In [126]:
fill = A.stack().mean()
A.add(B, fill_value= fill)

       A      B      C
0  18.00  18.00  14.75
1  11.00  10.00  14.75
2  18.75  10.75  10.75

In [127]:
## Ufuncs : Operations Between DataFrame and Series
A = rng.randint(10, size = (3,4))
A

array([[9, 3, 7, 6],
       [8, 7, 4, 1],
       [4, 7, 9, 8]])

In [128]:
A- A[0]

array([[ 0,  0,  0,  0],
       [-1,  4, -3, -5],
       [-5,  4,  2,  2]])

In [129]:
df = pd.DataFrame(A, columns= list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -1  4 -3 -5
2 -5  4  2  2

In [130]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  6  0  4  3
1  1  0 -3 -6
2 -3  0  2  1

In [131]:
halfrow = df.iloc[0, ::2]
halfrow

Q    9
S    7
Name: 0, dtype: int32

In [132]:
df-halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -1.0 NaN -3.0 NaN
2 -5.0 NaN  2.0 NaN

In [133]:
## Handling Missing Data
# None: Pythonic missing data
import numpy as np
import pandas as pd

In [134]:
vals1 = np.array([1, None, 3,4])
vals1

array([1, None, 3, 4], dtype=object)

In [135]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
201 ms  37.9 ms per loop (mean  std. dev. of 7 runs, 1 loop each)

dtype = int
4.07 ms  135 s per loop (mean  std. dev. of 7 runs, 100 loops each)

In [136]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [138]:
# NaN: Missing numerical data
vals2 =np.array([1, np.nan,3, 4])
vals2.dtype

dtype('float64')

In [139]:
1 + np.nan

nan

In [140]:
0 * np.nan

nan

In [141]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [142]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

In [143]:
# NaN and None in Pandas
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [144]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [145]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [146]:
## Operating on Null Values
# Detecting null values
data = pd.Series([1, np.nan, 'hello', None])

In [147]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [148]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [149]:
# Dropping null values
data.dropna()

0        1
2    hello
dtype: object

In [150]:
df = pd.DataFrame([[1, np.nan,2],
                  [2,3,5],
                  [np.nan,4,6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [151]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [152]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [153]:
df[3] =np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [154]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [155]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [156]:
# Filling null values
data = pd.Series([1,np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [157]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [158]:
# forward-fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [159]:
# back-fill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [160]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [163]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [164]:
## Hierarchical Indexing
import pandas as pd
import numpy as np

In [165]:
# A Multiply Indexed Series
# The bad way
index = [('California', 2000),('California',2010),
        ('New York', 2000), ('New York', 2010),
        ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 372539956,
              18976457, 19378102,
              20851820,25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)     33871648
(California, 2010)    372539956
(New York, 2000)       18976457
(New York, 2010)       19378102
(Texas, 2000)          20851820
(Texas, 2010)          25145561
dtype: int64

In [166]:
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    372539956
(New York, 2000)       18976457
(New York, 2010)       19378102
(Texas, 2000)          20851820
dtype: int64

In [167]:
pop[[i for i in pop.index if i[1]== 2010]]

(California, 2010)    372539956
(New York, 2010)       19378102
(Texas, 2010)          25145561
dtype: int64

In [168]:
# The better way: Pandas MultiIndex
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           codes=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [169]:
pop = pop.reindex(index)
pop

California  2000     33871648
            2010    372539956
New York    2000     18976457
            2010     19378102
Texas       2000     20851820
            2010     25145561
dtype: int64

In [170]:
pop[:, 2010]

California    372539956
New York       19378102
Texas          25145561
dtype: int64

In [171]:
# MultiIndex as extra dimension
pop_df = pop.unstack()
pop_df

                2000       2010
California  33871648  372539956
New York    18976457   19378102
Texas       20851820   25145561

In [172]:
pop_df.stack()

California  2000     33871648
            2010    372539956
New York    2000     18976457
            2010     19378102
Texas       2000     20851820
            2010     25145561
dtype: int64

In [174]:
pop_df = pd.DataFrame({'total':pop, 
                      'under18': [9267089, 9284094,
                                 4687374, 4318033,
                                 5906301, 6879014]})
pop_df

                     total  under18
California 2000   33871648  9267089
           2010  372539956  9284094
New York   2000   18976457  4687374
           2010   19378102  4318033
Texas      2000   20851820  5906301
           2010   25145561  6879014

In [175]:
f_u18 = pop_df['under18'] /pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.024921
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [176]:
## Methods of MultiIndex Creation
df = pd.DataFrame(np.random.rand(4,2),
                 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                 columns = ['data1', 'data2'])
df

        data1     data2
a 1  0.448644  0.982226
  2  0.272868  0.975131
b 1  0.593592  0.345545
  2  0.529052  0.381676

In [179]:
data ={('California', 2000) : 33871648,
      ('California', 2010) : 37253956,
      ('Texas', 2000) : 20851820,
      ('Texas', 2010) : 25145561,
      ('New York', 2000) : 18976457,
      ('New York', 2010) : 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [180]:
# Explicit MultiIndex constructors
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1,2,1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [182]:
pd.MultiIndex.from_tuples([('a',1),('a',2),('b',1),('b',2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [184]:
pd.MultiIndex.from_product([['a','b'],[1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [185]:
pd.MultiIndex(levels=[['a','b'],[1,2]],
             labels=[[0,0,1,1],[0,1,0,1]])

C:\Users\seung\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: the 'labels' keyword is deprecated, use 'codes' instead

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [186]:
## MultiIndex level  names
pop.index.names= ['state', 'year']
pop

state       year
California  2000     33871648
            2010    372539956
New York    2000     18976457
            2010     19378102
Texas       2000     20851820
            2010     25145561
dtype: int64

In [187]:
# MultiIndex for columns
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013,2014], [1,2]],
                                  names=['year','visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']], 
                                    names= ['subject', 'type'])
# mock some data
data = np.round(np.random.randn(4,6),1)
data[: ,::2]*= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      36.0  36.5  37.0  36.7  41.0  36.9
     2      24.0  37.5  40.0  38.0  33.0  37.2
2014 1      29.0  37.2  45.0  35.6  36.0  37.3
     2      44.0  38.3  49.0  38.7  35.0  38.6

In [188]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      37.0  36.7
     2      40.0  38.0
2014 1      45.0  35.6
     2      49.0  38.7

In [189]:
## Indexing and Slicing a MultiIndex
# Multiply indexed Series
pop

state       year
California  2000     33871648
            2010    372539956
New York    2000     18976457
            2010     19378102
Texas       2000     20851820
            2010     25145561
dtype: int64

In [190]:
pop['California',2000]

33871648

In [192]:
pop.loc['California':'New York']

state       year
California  2000     33871648
            2010    372539956
New York    2000     18976457
            2010     19378102
dtype: int64

In [193]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [194]:
pop[pop> 22000000]

state       year
California  2000     33871648
            2010    372539956
Texas       2010     25145561
dtype: int64

In [195]:
pop[['California', 'Texas']]

state       year
California  2000     33871648
            2010    372539956
Texas       2000     20851820
            2010     25145561
dtype: int64

In [196]:
# Multiply indexed DataFrames
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      36.0  36.5  37.0  36.7  41.0  36.9
     2      24.0  37.5  40.0  38.0  33.0  37.2
2014 1      29.0  37.2  45.0  35.6  36.0  37.3
     2      44.0  38.3  49.0  38.7  35.0  38.6

In [197]:
health_data['Guido', 'HR']

year  visit
2013  1        37.0
      2        40.0
2014  1        45.0
      2        49.0
Name: (Guido, HR), dtype: float64

In [198]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      36.0  36.5
     2      24.0  37.5

In [199]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        36.0
      2        24.0
2014  1        29.0
      2        44.0
Name: (Bob, HR), dtype: float64

In [200]:
health_data.loc[(:,1), (:,'HR')]

SyntaxError: invalid syntax (<ipython-input-200-67963efa6544>, line 1)

In [201]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:,'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      36.0  37.0  41.0
2014 1      29.0  45.0  36.0

In [202]:
## Rearranging Multi-Indices
# Sorted and unsorted indices
index = pd.MultiIndex.from_product([['a','c','b'],[1,2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char','int']
data

char  int
a     1      0.089425
      2      0.606030
c     1      0.781245
      2      0.859497
b     1      0.292624
      2      0.789044
dtype: float64

In [203]:
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [204]:
data= data.sort_index()
data

char  int
a     1      0.089425
      2      0.606030
b     1      0.292624
      2      0.789044
c     1      0.781245
      2      0.859497
dtype: float64

In [206]:
data['a':'b']

char  int
a     1      0.089425
      2      0.606030
b     1      0.292624
      2      0.789044
dtype: float64

In [207]:
# Stacking and unstacking indices
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010    372539956  19378102  25145561

In [208]:
pop.unstack(level=1)

year            2000       2010
state
California  33871648  372539956
New York    18976457   19378102
Texas       20851820   25145561

In [209]:
pop

state       year
California  2000     33871648
            2010    372539956
New York    2000     18976457
            2010     19378102
Texas       2000     20851820
            2010     25145561
dtype: int64

In [210]:
pop.unstack().stack()

state       year
California  2000     33871648
            2010    372539956
New York    2000     18976457
            2010     19378102
Texas       2000     20851820
            2010     25145561
dtype: int64

In [212]:
# Index setting and resetting
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010   372539956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [213]:
pop_flat.set_index(['state','year'])

                 population
state      year
California 2000    33871648
           2010   372539956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [214]:
## Data Aggregations on Multi-Indices
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      36.0  36.5  37.0  36.7  41.0  36.9
     2      24.0  37.5  40.0  38.0  33.0  37.2
2014 1      29.0  37.2  45.0  35.6  36.0  37.3
     2      44.0  38.3  49.0  38.7  35.0  38.6

In [216]:
data_mean = health_data.mean(level='year')
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     30.0  37.00  38.5  37.35  37.0  37.05
2014     36.5  37.75  47.0  37.15  35.5  37.95

In [217]:
data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  35.166667  37.133333
2014  39.666667  37.616667

In [218]:
## Combining Datasets : Concat and Append
import pandas as pd
import numpy as np

In [219]:
def make_df(cols,ind):
    """Quickly make a DataFrame"""
    data = {c:[str(c)+str(i) for i in ind]
           for c in cols}
    return pd.DataFrame(data, ind)
# example DataFrame
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [220]:
## Recall: Concatenation of NumPy Arrays
x=[1,2,3]
y=[4,5,6]
z=[7,8,9]
np.concatenate([x,y,z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [221]:
x=[[1,2],[3,4]]
np.concatenate([x,x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [223]:
## Simple Concatenation with pd.concat
# Siganture in Pandas v0.18
ser1 = pd.Series(['A','B','C'], index=[1,2,3])
ser2 = pd.Series(['D','E','F'], index=[4,5,6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [224]:
df1= make_df('AB', [1,2])
df2 = make_df('AB',[3,4])
print(df1); print(df2); print(pd.concat([df1, df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [226]:
df3 = make_df('AB', [0,1])
df4 = make_df('CD', [0,1])
print(df3); print(df4); print(pd.concat([df3, df4], axis='col'))

    A   B
0  A0  B0
1  A1  B1
    C   D
0  C0  D0
1  C1  D1

ValueError: No axis named col for object type <class 'type'>

In [227]:
# Duplicat indeices
x = make_df('AB', [0,1])
y = make_df('AB', [2,3])
y.index = x.index 
print(x); print(y); print(pd.concat([x,y]))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [233]:
# Catching the repeats as an error
try:
    pd.concat([x,y], verify_integrity=True)
except ValueError as e:
    print("ValueError:", e)

ValueError: Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

In [234]:
print(x); print(y); print(pd.concat([x,y], ignore_index=True))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [235]:
# Adding MultiIndex keys
print(x); print(y); print(pd.concat([x,y], keys=['x','y']))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [236]:
# Concatenation with joins
df5  = make_df('ABC', [1,2])
df6 = make_df('BCD',[3,4])
print(df5); print(df6); print(pd.concat([df5, df6]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

C:\Users\seung\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  after removing the cwd from sys.path.

In [239]:
print(df5); print(df6);
print(pd.concat([df5, df6], join='inner'))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [240]:
print(df5); print(df6);
print(pd.concat([df5, df6], join_axes=[df5.columns]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

In [241]:
#  The append() method
print(df1); print(df2); print(df1.append(df2))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [242]:
## Combining Datasets : Merge and Join
# Relational Algebra
# Categories of Joins
# One-to-one joins
df1 = pd.DataFrame({'employee':['Bob', 'Jake','Lisa','Sue'],
                   'group': ['Accounting','Engineering','Enginnering','HR']})
df2 = pd.DataFrame({'employee': ['Lisa','Bob', 'Jake','Sue'],
                   'hire_data':[2004,2008,2012,2014]})
print(df1); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Enginnering
3      Sue           HR
  employee  hire_data
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [243]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_data
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Enginnering       2004
3      Sue           HR       2014

In [245]:
# Many to one joins
df4 = pd.DataFrame({'group':['Accounting','Enginnering','HR'], 
                   'supervisor': ['Carly', 'Guido', 'Steve']})
print(df3); print(df4); print(pd.merge(df3, df4))

  employee        group  hire_data
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Enginnering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Enginnering      Guido
2           HR      Steve
  employee        group  hire_data supervisor
0      Bob   Accounting       2008      Carly
1     Lisa  Enginnering       2004      Guido
2      Sue           HR       2014      Steve

In [246]:
# Many to many joins
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting','Enginnering','Engineering','HR','HR'],
                   'skills':['math','spreadsheets','coding','linux','spreadsheets', 'organization']})
print(df1); print(df5); print(pd.merge(df1, df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Enginnering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Enginnering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering         linux
3     Lisa  Enginnering        coding
4      Sue           HR  spreadsheets
5      Sue           HR  organization

In [249]:
## Specification of the Merge Key
# The on keyword
print(df1);print(df2); print(pd.merge(df1,df2, on='employee'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Enginnering
3      Sue           HR
  employee  hire_data
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_data
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Enginnering       2004
3      Sue           HR       2014

In [250]:
# The left_on and right_on keywords
df3 = pd.DataFrame({'name' : ['Bob', 'Jake', 'Lisa', 'Sue'],
                  'salary': [70000, 80000, 120000, 90000]})
print(df1); print(df3); 
print(pd.merge(df1, df3, left_on="employee", right_on="name"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Enginnering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Enginnering  Lisa  120000
3      Sue           HR   Sue   90000

In [251]:
pd.merge(df1, df3, left_on='employee', right_on='name').drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Enginnering  120000
3      Sue           HR   90000

In [252]:
# The left_index and right_index keywords
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a);  print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Enginnering
Sue                HR
          hire_data
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [254]:
print(df1a); print(df2a);
print(pd.merge(df1a, df2a, left_index= True, right_index = True))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Enginnering
Sue                HR
          hire_data
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_data
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Enginnering       2004
Sue                HR       2014

In [255]:
print(df1a); print(df2a); print(df1a.join(df2a))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Enginnering
Sue                HR
          hire_data
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_data
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Enginnering       2004
Sue                HR       2014

In [257]:
print(df1a); print(df3);
print(pd.merge(df1a, df3, left_index=True, right_on='name'))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Enginnering
Sue                HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Enginnering  Lisa  120000
3           HR   Sue   90000

In [258]:
## Specifying Set Arithmetic for Joins
df6 = pd.DataFrame({'name':['Peter', 'Paul','Mary'],
                   'food': ['fish', 'beans', 'bread']},
                  columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'], 
                   'drink' :['wine', 'beer']},
                  columns=['name','drink'])
print(df6); print(df7); print(pd.merge(df6, df7))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
   name   food drink
0  Mary  bread  wine

In [259]:
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

In [260]:
print(pd.merge(df6, df7, how='outer'))

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [262]:
print(pd.merge(df6, df7, how='left'))

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [264]:
# overlapping Column Names: The suffixes Keyword
df8 = pd.DataFrame({'name': ['Bob', 'Jake','Lisa','Sue'],
                   'rank': [1,2,3,4]})
df9 = pd.DataFrame({'name':['Bob', 'Jake','Lisa','Sue'],
                   'rank':[3,1,4,2]})
print(df8); print(df9); print(pd.merge(df8, df9, on='name'))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [269]:
print(pd.merge(df8, df9, on="name", suffixes=["_L","_R"]))

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [272]:
import pandas as pd

In [274]:
## Example: US States Data

pop = pd.read_csv('data/state-population.csv')
areas= pd.read_csv('data/state-areas.csv')
abbrevs = pd.read_csv('data/state-abbrevs.csv')
print(pop.head()); print(areas.head()); print(abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [275]:
merged = pd.merge(pop, abbrevs, how='outer', left_on = 'state/region', right_on='abbreviation')
merged = merged.drop('abbreviation',1)
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [276]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [278]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [279]:
merged.loc[merged['state'].isnull(), 'state/region']. unique()

array(['PR', 'USA'], dtype=object)

In [280]:
final = pd.merge(merged, areas, on='state', how='left')
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [281]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state             True
area (sq. mi)     True
dtype: bool

In [282]:
## Aggregation and Grouping
## Planes Data
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [283]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [284]:
## Simple Aggregation in Pandas
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [285]:
ser.sum()

2.811925491708157

In [286]:
ser.mean()

0.5623850983416314

In [287]:
df =pd.DataFrame({'A': rng.rand(5),
                  'B': rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [288]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [289]:
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [290]:
planets.dropna(). describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [291]:
## GroupBy: Split, Apply, Combine
# Split, apply, combine
df = pd.DataFrame({'key': ['A','B','C','A','B','C'],
                  'data': range(6)}, columns=['key','data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [292]:
df.groupby('key')

In [293]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [294]:
## The groupBy object
# Column indexing
planets.groupby('method')

In [295]:
planets.groupby('method')['orbital_period']

In [296]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [297]:
# Iteration over groups
for(method, group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

In [298]:
# Dispatch methods
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.000000
       Eclipse Timing Variations           9.000000
       Imaging                            38.000000
       Microlensing                       23.000000
       Orbital Brightness Modulation       3.000000
       Pulsar Timing                       5.000000
       Pulsation Timing Variations         1.000000
       Radial Velocity                   553.000000
       Transit                           397.000000
       Transit Timing Variations           4.000000
mean   Astrometry                       2011.500000
       Eclipse Timing Variations        2010.000000
       Imaging                          2009.131579
       Microlensing                     2009.782609
       Orbital Brightness Modulation    2011.666667
       Pulsar Timing                    1998.400000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2007.518987
       Transit                          2011.236776
       Transit Timing Variations        2012.500000
std    Astrometry                          2.121320
       Eclipse Timing Variations           1.414214
       Imaging                             2.781901
       Microlensing                        2.859697
       Orbital Brightness Modulation       1.154701
       Pulsar Timing                       8.384510
       Pulsation Timing Variations              NaN
       Radial Velocity                     4.249052
       Transit                             2.077867
       Transit Timing Variations           1.290994
                                           ...
50%    Astrometry                       2011.500000
       Eclipse Timing Variations        2010.000000
       Imaging                          2009.000000
       Microlensing                     2010.000000
       Orbital Brightness Modulation    2011.000000
       Pulsar Timing                    1994.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2009.000000
       Transit                          2012.000000
       Transit Timing Variations        2012.500000
75%    Astrometry                       2012.250000
       Eclipse Timing Variations        2011.000000
       Imaging                          2011.000000
       Microlensing                     2012.000000
       Orbital Brightness Modulation    2012.000000
       Pulsar Timing                    2003.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2011.000000
       Transit                          2013.000000
       Transit Timing Variations        2013.250000
max    Astrometry                       2013.000000
       Eclipse Timing Variations        2012.000000
       Imaging                          2013.000000
       Microlensing                     2013.000000
       Orbital Brightness Modulation    2013.000000
       Pulsar Timing                    2011.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2014.000000
       Transit                          2014.000000
       Transit Timing Variations        2014.000000
Length: 80, dtype: float64

In [299]:
# Aggregate, filter, trhansform, apply
rng = np.random.RandomState(0)
df = pd.DataFrame({'key':['A', 'B','C','A','B','C'],
                  'data1': range(6),
                  'data2': rng.randint(0,10,6)},
                 columns = ['key', 'data1','data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [300]:
# Aggregation
df.groupby('key').aggregate(['min', np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [301]:
df.groupby('key').aggregate({'data1':'min', 'data2': 'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [302]:
# Filtering
def filter_func(x):
    return x['data2'].std() >4
print(df);print(df.groupby('key').std());
print(df.groupby('key').filter(filter_func))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641
  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [303]:
# Transformation
df.groupby('key').transform(lambda x:x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [304]:
# The apply( ) method
def norm_by_data2(x):
    x['data1']/=x['data2'].sum()
    return x
print(df); print(df.groupby('key').apply(norm_by_data2))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

In [305]:
# Specifying the split keys
# A list, array, series, or index providing the goruping keys
L = [0, 1, 0, 1, 2, 0]
print(df); print(df.groupby(L).sum())

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
   data1  data2
0      7     17
1      4      3
2      4      7